<div class="container">

    <h1>История Казани</h1>
    <p>Время основания Казани относится к концу девятого – началу десятого века. Первые, самые давние, десятилетия существования Казани относятся к тому периоду, когда на территории современного Татарстана располагалась Волжская Булгария. Казань была одной из её северных военных крепостей.</p>
    
       <p> По поводу происхождения названия Казани до сих пор ведутся споры, но большинство исследователей сходятся во мнении, что оно произошло от татарского слова «казан», означающего «котёл».</p>
        
       <p> В тринадцатом веке началась многолетняя эпоха монгольского нашествия, в начале которой жители Волжской Булгарии боролись с кочевниками довольно успешно – в 1223 году первое вторжение Чингисхана было отбито. Но, спустя тринадцать лет, в 1236 году, внук Чингисхана – Батый – всё-таки поработил независимую Булгарию, разрушив её почти до основания. 
        В это время происходило формирование Золотой Орды, и территория современной Казани вошла в её состав.</p>
        
       <p> После захвата земель игом города стали восстанавливаться, и уже через сто лет Казань считалась центральным городом Волжской Булгарии, спустя пару десятков лет она приобрела статус княжеского города в рамках Орды.</p>
        
       <p> Пропустив значительный период истории Казани, перейдём сразу к двадцатому веку. После революции 1917 года власть в Казани перешла в руки Советов, а в 1920 году была создана Татарская автономная ССР.</p>
        
        <p>В годы Второй мировой войны в Казань было эвакуировано множество заводов и предприятий, поэтому жители города смогли внести ощутимый вклад в борьбу за Победу.</p>
        
        <p>В 2000 году Казанский Кремль был включён в список объектов мирового культурного наследия ЮНЕСКО. А в 2005 году в истории Казани произошло значимое событие – тысячелетний юбилей, который отмечался с особым размахом. Кроме увеселительных мероприятий и международных конференций, проводимых в рамках празднования тысячелетия Казани, к юбилею был завершен ряд бытовых программ, таких, как ликвидация ветхого жилья, реставрация исторических архитектурных памятников (в том числе – Казанского Кремля), создание спортивных комплексов и, наконец, торжественный пуск первой казанской линии метрополитена.</p>
</div>


<style>
    .container{
       

        display: flex;
        justify-content: center;
        flex-direction: column;
        align-items: center;
        background-image: url(../../components/imges/imgonline-com-ua-Osvetlenie-5KHAqsiDI0pDwFmZ.jpg);
        background-size: cover;
        background-repeat: no-repeat;
        border-radius: 20px;
        margin: 10px;
        

    }

    p{
        font-size: 20px;
        padding:  0 35px;
        font-weight: 500;
    }

    h1{
        font-size: 40px;
    }
</style>