<div class="container">
    <h1> Достопримечательности</h1>
    <div class="posts">
        
            <div class="first">

                
                            <div class="post">
                                <h2>Кремль</h2>
                                <img src="src\components\imges\00_kazan.jpg" alt="казанский кремль" width="400px">
                                <p>Даже если вы приезжаете в город на одни сутки, посвятите их походу к Кремлю (официальная резиденция главы Татарстана). Дата строительства исторического объекта – 10 столетие. Территория, по сути, является комплексом археологических и архитектурных ценностей: зданий культурного назначения, храмов, белокаменного Кремля, третьего, второго и первого городищ.</p>
                                <!-- <p class="readmore">
                                    <a  class="link" href ="">Read more</a>
                                </p> -->
                            </div>
                            <div class="post">
                                <h2>Храм всех религий</h2>
                                <img src="src\components\imges\hram_relegii.jpg" alt="храм всех религий"  width="400px">
                                <p>Немногие достопримечательности Казани настолько же необычайные, как это здание. В уникальной постройке собрано 16 вероисповеданий (иудаизм, католицизм, православие и т.д.), включая те, которые уже не существуют. Здание построила семья Хановых, начав работы в 90-х годах.</p>
                                <!-- <p class="readmore">
                                    <a  class="link" href ="">Read more</a>
                                </p> -->
                            </div>
                            
            </div>
            <div class="second">

                <div class="post">
                    <h2>Национальный музей Республики Татарстан</h2>
                    <img src="src\components\imges\Национальный_музей_РТ.jpg" alt="Национальный музей Республики Татарстан" width="400px">
                    <p>Крупнейший музейный комплекс столицы, достойный войти в любой список «главные достопримечательности Казани: кратко и с фото». Экспозиции рассказывают о традициях и исторических событиях Республики и ее населения. Эпохи совершенно различные – от современности до исторических времен. В числе прочих представлена выставка, демонстрирующая образцы природы Татарстана. Оригинальная карета Екатерины Второй (на улице Баумана находится высокоточная копия этого легендарного транспортного средства) хранится именно здесь.</p>
                    <!-- <p class="readmore">
                        <a  class="link" href ="">Read more</a>
                    </p> -->
                </div>
                <div class="post">
                    <h2>Улица Баумана</h2>
                    <img src="src\components\imges\95x9cdmy58g0sosckwooc88kw.jpg" alt="Улица Баумана" width="400px">
                    <p>Главная, самая знаменитая и старинная улицу столицы. Здесь располагаются многочисленные архитектурные и культурные шедевры – Карета Екатерины Второй, памятник Казанскому Коту, монумент Шаляпину. Современный пешеходный «казанский Арбат» познакомит вас с Драмтеатром, Богоявленским храмом, прекрасными монастырями. Вы сможете посмотреть на фонтаны и скульптурные композиции, провести шоппинг в лучших магазинах города и покушать в кафе, где подаются национальные блюда и напитки.</p>
                    <!-- <p class="readmore">
                        <a  class="link" href ="">Read more</a>
                    </p> -->
                </div>
            </div>
       </div>
        </div>
        
  



<style>
    .container{
        
        
        padding: 0 20px;
        display: flex;
        flex-direction: column;
        align-items: center;
        justify-content: center;
    }
    
    .post{
        border: 1px solid #ddd;
        padding: 10px;
        box-shadow: 0 0 10px #8d8d8d;
        display: flex;
        flex-direction: column;
        align-items: center;
        margin: 30px;
        border-radius: 20px;
       
    }
    p{
        padding: 15px;
    }
    img{
        border-radius: 15px;
    }
    
    .posts{
        display: flex;
        
       
    }
</style>